[
    {
        "name": "Albedo",
        "rarity": 5,
        "weapon": "Sword",
        "vision": "Geo",
        "birthday": "9/13",
        "constellations": 
        [
            "Princeps Cretaceus",
            [
                "Flower of Eden", 
                "Transient Blossoms generated by Albedo's Abiogenesis: Solar Isotoma regenerate 1.2 Energy for Albedo."
            ],
            [
                "Opening of Phanerozoic", 
                "Transient Blossoms generated by Abiogenesis: Solar Isotoma grant Albedo Fatal Reckoning for 30s: Unleashing Rite of Progeniture: Tectonic Tide consumes all stacks of Fatal Reckoning. Each stack of Fatal Reckoning consumed increases the DMG dealt by Fatal Blossoms and Rite of Progeniture: Tectonic Tide's burst DMG by 30% of Albedo's DEF. This effect stacks up to 4 times."
            ],
            [
                "Grace of Helios", 
                "Increases the Level of Abiogenesis: Solar Isotoma by 3. Maximum upgrade level is 15."
            ],
            [
                "Descent of Divinity", 
                "Active party members within the Solar Isotoma field have their Plunging Attack DMG increased by 30%."
            ],
            [
                "Tide of Hadean", 
                "Increases the Level of Rite of Progeniture: Tectonic Tide by 3. Maximum upgrade level is 15."
            ],
            [
                "Dust of Purification",
                "Active party members within the Solar Isotoma field who are protected by a shield created by Crystallize have their DMG increased by 17%."
            ]
        ],
        "modelType": "Medium Male",
        "specialDish": "Woodland Dream",
        "Region": "Mondstadt",
        "talents": [
            [
                "Elemental Skill", 
                "Abiogenesis: Solar Isotoma",
                "Albedo creates a Solar Isotoma using alchemy, which deals AoE Geo DMG on appearance. Solar Isotoma has the following properties: When opponents within the Solar Isotoma field take DMG, the Solar Isotoma will generate Transient Blossoms which deal AoE Geo DMG. DMG dealt scales off Albedo's DEF. Transient Blossoms can only be generated once every 2s. When a character is located at the locus of the Solar Isotoma, the Solar Isotoma will accumulate Geo power to form a crystallized platform that lifts the character up to a certain height. Only one crystallized platform can exist at a time. Solar Isotoma is considered a Geo construct. Only one Solar Isotoma created by Albedo himself can exist at a time. Hold to designate the location of the skill."
            ],
            [
                "Elemental Burst",
                "Rite of Progeniture: Tectonic Tide",
                "Under Albedo's command, Geo crystals surge and burst forth, dealing AoE Geo DMG in front of him. If a Solar Isotoma created by Albedo himself is on the field, 7 Fatal Blossoms will be generated in the Solar Isotoma field, bursting violently into bloom and dealing AoE Geo DMG. Tectonic Tide DMG and Fatal Blossom DMG will not generate Transient Blossoms."
            ],
            [
                "1st Ascension Passive",
                "Calcite Might",
                "Transient Blossoms generated by Abiogenesis: Solar Isotoma deal 25% more DMG to opponents whose HP is below 50%."
            ],
            [
                "4th Ascension Passive",
                "Homuncular Nature",
                "Using Rite of Progeniture: Tectonic Tide increases the Elemental Mastery of nearby party members by 125 for 10s."
            ],
            [
                "Utility Passive",
                "Flash of Genius",
                "When Albedo crafts Weapon Ascension Materials, he has a 10% chance to receive double the product."
            ]
        ]
    },
    {
        "name": "Aloy",
        "rarity": 5,
        "weapon": "Bow",
        "vision": "Cryo",
        "birthday": "4/4",
        "constellations": 
        [
            "Nora Fortis",
            [
                "Star of Another World (1)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (2)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (3)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (4)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (5)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (6)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ]
        ],
        "modelType": "Medium Female",
        "specialDish": "Satiety Gel",
        "Region": "Horizon Zero Dawn",
        "talents": [
            [
                "Elemental Skill", 
                "Frozen Wilds",
                "Aloy throws a Freeze Bomb in the targeted direction that explodes on impact, dealing Cryo DMG. After it explodes, the Freeze Bomb will split up into many Chillwater Bomblets that explode on contact with opponents or after a short delay, dealing Cryo DMG. When a Freeze Bomb or Chillwater Bomblet hits an opponent, the opponent's ATK is decreased and Aloy receives 1 Coil stack. Aloy can gain up to 1 Coil stack every 0.1s. Coil Each stack increases Aloy's Normal Attack DMG. When Aloy has 4 Coil stacks, all stacks of Coil are cleared. She then enters the Rushing Ice state, which further increases the DMG dealt by her Normal Attacks and converts her Normal Attack DMG to Cryo DMG. While in the Rushing Ice state, Aloy cannot obtain new Coil stacks. Coil effects will be cleared 30s after Aloy leaves the field."
            ],
            [
                "Elemental Burst",
                "Prophecies of Dawn",
                "Aloy throws a Power Cell filled with Cryo in the targeted direction, then detonates it with an arrow, dealing AoE Cryo DMG."
            ],
            [
                "1st Ascension Passive",
                "Combat Override",
                "When Aloy receives the Coil effect from Frozen Wilds, her ATK is increased by 16%, while nearby party members' ATK is increased by 8%. This effect lasts 10s."
            ],
            [
                "4th Ascension Passive",
                "Strong Strike",
                "When Aloy is in the Rushing Ice state conferred by Frozen Wilds, her Cryo DMG Bonus increases by 3.5% every 1s. A maximum Cryo DMG Bonus increase of 35% can be gained in this way."
            ],
            [
                "Utility Passive",
                "Easy Does It",
                "When Aloy is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them."
            ]
        ]
    },
    {
        "name": "Amber",
        "rarity": 4,
        "weapon": "Bow",
        "vision": "Pyro",
        "birthday": "8/10",
        "constellations": 
        [
            "Lepus",
            [
                "Star of Another World (1)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (2)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (3)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (4)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (5)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ],
            [
                "Star of Another World (6)", 
                "The time has not yet come for this person's corner of the night sky to light up."
            ]
        ],
        "modelType": "Medium Female",
        "specialDish": "Outrider's Champion Steak!",
        "Region": "Mondstadt",
        "talents": [
            [
                "Elemental Skill", 
                "Explosive Puppet",
                "The ever-reliable Baron Bunny takes the stage. Baron Bunny Continuously taunts the enemy, drawing their fire. Baron Bunny's HP scales with Amber's Max HP. When destroyed or when its timer expires, Baron Bunny explodes, dealing AoE Pyro DMG. Hold Adjusts the throwing direction of Baron Bunny. The longer the button is held, the further the throw."
            ],
            [
                "Elemental Burst",
                "Fiery Rain",
                "Fires off a shower of arrows, dealing continuous AoE Pyro DMG."
            ],
            [
                "1st Ascension Passive",
                "Every Arrow Finds Its Target",
                "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%."
            ],
            [
                "4th Ascension Passive",
                "Precise Shot",
                "Aimed Shot hits on weak spots increase ATK by 15% for 10s."
            ],
            [
                "Utility Passive",
                "Gliding Champion",
                "Decreases gliding Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
            ],
            [
                "Normal Attack",
                "Sharpshooter",
                "Normal Attack Perform up to 5 consecutive shots with a bow. Charged Attack Perform a more precise Aimed Shot with increased DMG. While aiming, flames will accumulate on the arrowhead. A fully charged flaming arrow will deal Pyro DMG. Plunging Attack Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact."
            ]
        ]
    }
]